In [29]:
from datascience import*
import numpy as np

In [37]:
more_cones = Table().with_columns(
    'Flavor', make_array('strawberry', 'chocolate', 'chocolate', 'strawberry', 'chocolate', 'bubblegum'),
    'Color', make_array('pink', 'light brown', 'dark brown', 'pink', 'dark brown', 'pink'),
    'Price', make_array(3.55, 4.75, 5.25, 5.25, 5.25, 4.75)
)

more_cones

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
bubblegum  | pink        | 4.75

In [4]:
more_cones.group('Flavor')

Flavor     | count
bubblegum  | 1
chocolate  | 3
strawberry | 2

In [5]:
more_cones.group(['Flavor', 'Color'])

Flavor     | Color       | count
bubblegum  | pink        | 1
chocolate  | dark brown  | 2
chocolate  | light brown | 1
strawberry | pink        | 2

In [6]:
more_cones.pivot('Flavor', 'Color')

Color       | bubblegum | chocolate | strawberry
dark brown  | 0         | 2         | 0
light brown | 0         | 1         | 0
pink        | 1         | 0         | 2

In [7]:
more_cones.pivot('Flavor', 'Color', values='Price', collect=sum)

Color       | bubblegum | chocolate | strawberry
dark brown  | 0         | 10.5      | 0
light brown | 0         | 4.75      | 0
pink        | 4.75      | 0         | 8.8

In [8]:
more_cones.group(['Flavor', 'Color'], sum)

Flavor     | Color       | Price sum
bubblegum  | pink        | 4.75
chocolate  | dark brown  | 10.5
chocolate  | light brown | 4.75
strawberry | pink        | 8.8

In [9]:
full_table = Table.read_table('personal_income.csv')
ca_2014 = full_table.where('Year', are.equal_to('01/01/2014 12:00:00 AM')).where('Age', are.not_equal_to('00 to 17'))
ca_2014

Year                   | Age      | Gender | Educational Attainment    | Personal Income    | Population Count
01/01/2014 12:00:00 AM | 18 to 64 | Male   | No high school diploma    | No Income          | 376783
01/01/2014 12:00:00 AM | 18 to 64 | Male   | No high school diploma    | $5,000 to $9,999   | 158572
01/01/2014 12:00:00 AM | 18 to 64 | Male   | No high school diploma    | $10,000 to $14,999 | 231957
01/01/2014 12:00:00 AM | 18 to 64 | Male   | No high school diploma    | $15,000 to $24,999 | 460129
01/01/2014 12:00:00 AM | 18 to 64 | Male   | No high school diploma    | $25,000 to $34,999 | 288460
01/01/2014 12:00:00 AM | 18 to 64 | Male   | No high school diploma    | $35,000 to $49,999 | 194888
01/01/2014 12:00:00 AM | 18 to 64 | Male   | No high school diploma    | $50,000 to $74,999 | 104646
01/01/2014 12:00:00 AM | 18 to 64 | Male   | No high school diploma    | $75,000 and over   | 54734
01/01/2014 12:00:00 AM | 18 to 64 | Male   | High school or equivalent | No Income          | 405204
01/01/2014 12:00:00 AM | 18 to 64 | Male   | High school or equivalent | $5,000 to $9,999   | 238754
... (117 rows omitted)

In [10]:
educ_inc = ca_2014.select('Educational Attainment', 'Personal Income', 'Population Count')
educ_inc

Educational Attainment    | Personal Income    | Population Count
No high school diploma    | No Income          | 376783
No high school diploma    | $5,000 to $9,999   | 158572
No high school diploma    | $10,000 to $14,999 | 231957
No high school diploma    | $15,000 to $24,999 | 460129
No high school diploma    | $25,000 to $34,999 | 288460
No high school diploma    | $35,000 to $49,999 | 194888
No high school diploma    | $50,000 to $74,999 | 104646
No high school diploma    | $75,000 and over   | 54734
High school or equivalent | No Income          | 405204
High school or equivalent | $5,000 to $9,999   | 238754
... (117 rows omitted)

In [11]:
totals = educ_inc.pivot('Educational Attainment', 'Personal Income', values='Population Count', collect=sum)
totals

Personal Income    | Bachelor's degree or higher | High school or equivalent | No high school diploma | Some college, less than 4-yr degree
$10,000 to $14,999 | 452449                      | 692661                    | 664607                 | 798596
$15,000 to $24,999 | 773684                      | 1.25238e+06               | 875498                 | 1.34526e+06
$25,000 to $34,999 | 693884                      | 929218                    | 464564                 | 1.09164e+06
$35,000 to $49,999 | 1.12279e+06                 | 782804                    | 260579                 | 1.11242e+06
$5,000 to $9,999   | 326020                      | 626499                    | 597039                 | 810641
$50,000 to $74,999 | 1.59468e+06                 | 525517                    | 132516                 | 883826
$75,000 and over   | 2.9867e+06                  | 323192                    | 58945                  | 748103
No Income          | 575491                      | 1.16187e+06               | 1.20453e+06            | 985011

In [30]:
def percents(counts):
    """Convert the values in array_x to percents out of the total of array_x."""
    total = counts.sum()
    return np.round((counts/total)*100, 2)

In [31]:
distributions = totals.select(0).with_columns(
    "Bachelor's degree or higher", percents(totals.column(1)),
    'College, less than 4-yr degree', percents(totals.column(2)),
    'High school or equivalent', percents(totals.column(3)),
    'No high school diploma', percents(totals.column(4))   
    )

distributions

Personal Income    | Bachelor's degree or higher | College, less than 4-yr degree | High school or equivalent | No high school diploma
$10,000 to $14,999 | 5.31                        | 11                             | 15.61                     | 10.27
$15,000 to $24,999 | 9.07                        | 19.9                           | 20.56                     | 17.3
$25,000 to $34,999 | 8.14                        | 14.76                          | 10.91                     | 14.04
$35,000 to $49,999 | 13.17                       | 12.44                          | 6.12                      | 14.31
$5,000 to $9,999   | 3.82                        | 9.95                           | 14.02                     | 10.43
$50,000 to $74,999 | 18.7                        | 8.35                           | 3.11                      | 11.37
$75,000 and over   | 35.03                       | 5.13                           | 1.38                      | 9.62
No Income          | 6.75                        | 18.46                          | 28.29                     | 12.67

In [36]:
distributions.select(0, 1, 4).barh(0)